openFoamV8/ungs/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf constant/polyMesh/sets

#runApplication blockMesh
#runApplication snappyHexMesh -overwrite
#runApplication splitMeshRegions -cellZones -overwrite
#runApplication decomposePar -allRegions
#runParallel $(getApplication)
#runApplication reconstructPar -allRegions
#paraFoam -touchAlm
mpirun -np 4 chtMultiRegionFoam -parallel
