openFoamV8/ungs/constant/metal/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/metal/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    metalInlet
    {
        type            patch;
        nFaces          1214;
        startFace       1729761;
    }
    metalOutlet
    {
        type            patch;
        nFaces          1214;
        startFace       1730975;
    }
    metalExternal
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8250;
        startFace       1732189;
    }
    metal_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          211200;
        startFace       1740439;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_metal;
    }
    metal_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          138;
        startFace       1951639;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_metal;
    }
)

// ************************************************************************* //
