openFoamV8/ungs/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    metalInlet
    {
        type            patch;
        nFaces          1214;
        startFace       3319332;
    }
    fluidInlet
    {
        type            patch;
        nFaces          468;
        startFace       3320546;
    }
    metalOutlet
    {
        type            patch;
        nFaces          1214;
        startFace       3321014;
    }
    fluidOutlet
    {
        type            patch;
        nFaces          468;
        startFace       3322228;
    }
    metalExternal
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8250;
        startFace       3322696;
    }
)

// ************************************************************************* //
